jaimeevv/simon-says-msp430/Proyecto/main.c
#include <msp430.h>
#include <stdio.h>
#include <stdint.h>

#include "grlib.h"
#include "Crystalfontz128x128_ST7735.h"
#include "HAL_MSP430G2_Crystalfontz128x128_ST7735.h"

int i=0;

// Notas musicales y sus frecuencias
#define DO   262
#define MI   330
#define SOL  392
#define SI   494
#define DO2  523

// Notas extra para la victoria final
#define RE   294
#define FA   349
#define LA   440
#define RE2  587
#define MI2  659
#define SOL2 784

#define GRAPHICS_COLOR_DARK_YELLOW  0x008B5400
#define GRAPHICS_COLOR_BRIGHT_GREEN   0x007FFF00   // verde muy vivo (R=127, G=255, B=0)

Graphics_Context g_sContext;

// Modo accesible: 0 = colores, 1 = símbolos
unsigned char modo_simbolos = 0;


// Flags de despertar
volatile unsigned char tick = 0;
volatile unsigned char start = 0;
volatile unsigned long contador_ticks = 0;

// Boton 1 (P1.1)
volatile unsigned char boton1 = 0;

// Joystick inicial
volatile unsigned int ejex = 512;
volatile unsigned int ejey = 512;

// Funcion reloj
void Set_Clk(char VEL){
    BCSCTL2 = SELM_0 | DIVM_0 | DIVS_0;
    switch(VEL){
    case 16:
        if (CALBC1_16MHZ != 0xFF) {
            __delay_cycles(100000);
            DCOCTL = 0x00;
            BCSCTL1 = CALBC1_16MHZ;
            DCOCTL = CALDCO_16MHZ;
        }
        break;
    case 8:
        if (CALBC1_8MHZ != 0xFF) {
            __delay_cycles(100000);
            DCOCTL = 0x00;
            BCSCTL1 = CALBC1_8MHZ;
            DCOCTL = CALDCO_8MHZ;
        }
        break;
    default:
        if (CALBC1_1MHZ != 0xFF) {
            DCOCTL = 0x00;
            BCSCTL1 = CALBC1_1MHZ;
            DCOCTL = CALDCO_1MHZ;
        }
        break;
    }
    BCSCTL1 |= XT2OFF | DIVA_0;
    BCSCTL3 = XT2S_0 | LFXT1S_2 | XCAP_1;
}

// Funcion que inicializa el ADC
void inicia_ADC(char canales){
    ADC10CTL0 &= ~ENC;
    ADC10CTL0 = ADC10ON | ADC10SHT_3 | SREF_0 | ADC10IE;
    ADC10CTL1 = CONSEQ_0 | ADC10SSEL_0 | ADC10DIV_0 | SHS_0 | INCH_0;
    ADC10AE0 = canales;
    ADC10CTL0 |= ENC;
}

// Funcion para leer el valor del ADC
int lee_ch(char canal){
    ADC10CTL0 &= ~ENC;
    ADC10CTL1 &= (0x0fff);
    ADC10CTL1 |= canal<<12;
    ADC10CTL0 |= ENC;
    ADC10CTL0 |= ADC10SC;
    LPM0;
    return (ADC10MEM);
}

// Rutina de interrupcion ADC
#pragma vector=ADC10_VECTOR
__interrupt void ConvertidorAD(void){
    LPM0_EXIT;
}

// Funcion Timer 25ms
void timer_tick(void){
    TA0CTL = TASSEL_2 | ID_3 | MC_1;  // SMCLK/8 = 2MHz
    TA0CCR0 = 49999;                 // 25ms
    TA0CCTL0 = CCIE;
}

// Rutina de interrupcion Timer
#pragma vector=TIMER0_A0_VECTOR
__interrupt void Interrupcion_T0(void){
    tick = 1;
    contador_ticks++;
    LPM0_EXIT;
}

// Funcion que inicializa el boton de start (boton del joystick)
void boton_start(void){
    P2DIR &= ~BIT5;
    P2REN |= BIT5;
    P2OUT |= BIT5;
    P2IFG &= ~BIT5;
    P2IES |= BIT5;
    P2IE  |= BIT5;
}

// Funcion que inicializa el boton 1 (P1.1)
void boton_1(void){
    P1DIR &= ~BIT1;
    P1REN |= BIT1;
    P1OUT |= BIT1;
    P1IFG &= ~BIT1;
    P1IES |= BIT1;
    P1IE  |= BIT1;
}

// Rutina de interrupcion Boton Joystick
#pragma vector=PORT2_VECTOR
__interrupt void Interrupcion_P2(void){
    if(!(P2IN & BIT5)){
        start = 1;
    }
    P2IFG &= ~BIT5;
    LPM0_EXIT;
}

// Rutina de interrupcion Boton 1 (P1.1)
#pragma vector=PORT1_VECTOR
__interrupt void Interrupcion_P1(void){
    if(!(P1IN & BIT1)){
        boton1 = 1;
    }
    P1IFG &= ~BIT1;
    LPM0_EXIT;
}

// Buzzer desactivado por defecto
volatile unsigned char buzzer_activo = 0;

// Funcion que inicializa el buzzer
void init_buzzer(void){
    P2DIR  |= BIT6;
    P2SEL  &= ~BIT6;
    P2SEL2 &= ~BIT6;
    P2OUT  &= ~BIT6;

    TA1CTL = MC_0;
    TA1CCTL0 = 0;
    TA1CCR0 = 1000;
}

// Funcion que activa el sonido
void suena_hz(unsigned int hz){
    unsigned long cuenta_media = 1000000UL / (unsigned long)hz; // 2MHz/(2*hz)

    if(cuenta_media < 10) cuenta_media = 10;
    if(cuenta_media > 65535) cuenta_media = 65535;

    TA1CTL = TASSEL_2 | ID_3 | MC_1;   // SMCLK/8 => 2MHz, UP
    TA1CCR0 = (unsigned int)(cuenta_media - 1);
    TA1CCTL0 = CCIE;

    buzzer_activo = 1;
}

// Funcion que desactiva el sonido
void apaga_sonido(void){
    buzzer_activo = 0;
    TA1CCTL0 &= ~CCIE;
    TA1CTL = MC_0;
    P2OUT &= ~BIT6;
}

// Rutina de interrupcion buzzer
#pragma vector=TIMER1_A0_VECTOR
__interrupt void Interrupcion_T1(void){
    if(buzzer_activo) P2OUT ^= BIT6;
    else             P2OUT &= ~BIT6;
}

// Funcion que segun el color que elijamos con el joystick, sonara un sonido u otro
void sonido_color(unsigned char color){
    // 1: arriba, 2: derecha, 3: abajo, 4: izquierda
    switch(color){
    case 1: suena_hz(DO);  break;
    case 2: suena_hz(MI);  break;
    case 3: suena_hz(SOL); break;
    case 4: suena_hz(SI);  break;
    default: apaga_sonido();    break;
    }
}

// LFSR (generador de secuencia pseudoaleatoria)
static uint16_t lfsr = 0xACE1u;

// Funcion para almacenar la semilla
void semilla(uint16_t s){
    if(s == 0) {
        s = 0xACE1u; // Evitamos semilla a 0
    }
    lfsr = s; // Guardamos la semilla
}

// Funcion para calcular los bits de la semilla
uint16_t lfsr_siguiente(void){
    uint16_t bit = ((lfsr >> 0) ^ (lfsr >> 2) ^ (lfsr >> 3) ^ (lfsr >> 5)) & 1; // Calculamos un nuevo bit como el XOR de varios taps
    lfsr = (lfsr >> 1) | (bit << 15); // Desplazamos el bit y lo metemos por la izquierda
    return lfsr; // Devolvemos el nuevo valor
}

unsigned char aleatorio_1_4(void){
    return (unsigned char)((lfsr_siguiente() & 0x03) + 1);
}

// Funcion para dibujar una estrella simple (pequeña o grande)
void dibuja_estrella(unsigned char x, unsigned char y, unsigned char grande, uint32_t color){
    Graphics_setForegroundColor(&g_sContext, color);

    if(!grande){
        Graphics_Rectangle p = (Graphics_Rectangle){ x, y, x, y };
        Graphics_fillRectangle(&g_sContext, &p);
    }
    else{
        Graphics_Rectangle h = (Graphics_Rectangle){ (int)(x-2), (int)y, (int)(x+2), (int)y };
        Graphics_Rectangle v = (Graphics_Rectangle){ (int)x, (int)(y-2), (int)x, (int)(y+2) };
        Graphics_fillRectangle(&g_sContext, &h);
        Graphics_fillRectangle(&g_sContext, &v);
    }
}

// Funcion principal

int main(void){
    WDTCTL = WDTPW | WDTHOLD; // Stop watchdog-timer

    Set_Clk(16); // Reloj de 16 MHz
    inicia_ADC(BIT0 | BIT3); // Joystick A0 y A3

    // Iniciamos lo correspondiente a la pantalla LCD
    Crystalfontz128x128_Init();
    Crystalfontz128x128_SetOrientation(LCD_ORIENTATION_UP);
    Graphics_initContext(&g_sContext, &g_sCrystalfontz128x128);
    Graphics_setFont(&g_sContext, &g_sFontCm16b);
    Graphics_setBackgroundColor(&g_sContext, GRAPHICS_COLOR_BLACK);
    Graphics_clearDisplay(&g_sContext);

    init_buzzer(); // Inicializamos el buzzer
    timer_tick(); // Inicializamos el timer
    boton_start(); // Inicializamos el boton de start
    boton_1(); // Inicializamos el boton 1

