jaimeevv/simon-says-msp430/Proyecto/main.c
    __bis_SR_register(GIE);

    // Dibujo de los elementos del juego
    Graphics_Rectangle boton[4]; // 4 rectangulos del simon dice

    unsigned int xC = 64; // Centro X
    unsigned int yC = 70; // Centro Y
    unsigned int c  = 26;  // Tamaño del hueco central
    unsigned int t  = 30;  // Grosor del anillo

    // Coordenadas del hueco central
    unsigned int x0 = xC - c/2;
    unsigned int x1 = xC + c/2;
    unsigned int y0 = yC - c/2;
    unsigned int y1 = yC + c/2;

    // Coordenadas del contorno exterior del anillo
    unsigned int xL = xC - (c/2 + t);
    unsigned int xR = xC + (c/2 + t);
    unsigned int yT = yC - (c/2 + t);
    unsigned int yB = yC + (c/2 + t);

    unsigned int gJ = 3;   // Espacio de separacion entre rectangulos del anillo

    // Coordenadas de los rectangulos
    boton[0] = (Graphics_Rectangle){(int)(x0 + gJ),(int)yT,(int)(xR),(int)y0}; // Amarillo (arriba)
    boton[1] = (Graphics_Rectangle){ (int)x1,(int)(y0 + gJ),(int)xR,(int)yB}; // Azul (derecha)
    boton[2] = (Graphics_Rectangle){(int)(xL),(int)y1,(int)(x1 - gJ),(int)yB}; // Verde (abajo)
    boton[3] = (Graphics_Rectangle){ (int)xL, (int)yT, (int)x0, (int)(y1 - gJ) }; // Rojo (izquierda)

    // Marco exterior
    Graphics_Rectangle marco = (Graphics_Rectangle){ 2, 2, 125, 125 };

    // Barra de porcentaje
    Graphics_Rectangle barra = (Graphics_Rectangle){ 12, 8, 110, 18 };
    Graphics_Rectangle caja_pct = (Graphics_Rectangle){ 112, 8, 120, 18 };

    // Animacion victoria
    Graphics_Rectangle barra1 = (Graphics_Rectangle){44,90,52,114};
    Graphics_Rectangle barra2 = (Graphics_Rectangle){58,90,66,114};
    Graphics_Rectangle barra3 = (Graphics_Rectangle){72,90,80,114};
    Graphics_Rectangle marco_eq = (Graphics_Rectangle){36,86,88,118};

    // Array colores (arriba, derecha, abajo, izquierda)
    uint32_t color_alto[4], color_bajo[4];

    // Array de simbolos
    static const int8_t simbolos[4][2] = { {'#',0}, {'@',0}, {'$',0}, {'%',0} };



    // Asignamos los colores al array de colores iluminados
    color_alto[0] = GRAPHICS_COLOR_YELLOW;
    color_alto[1] = GRAPHICS_COLOR_BLUE;
    color_alto[2] = GRAPHICS_COLOR_BRIGHT_GREEN;
    color_alto[3] = GRAPHICS_COLOR_RED;

    // Asignamos los colores al array de colores apagados
    color_bajo[0] = GRAPHICS_COLOR_DARK_YELLOW;
    color_bajo[1] = GRAPHICS_COLOR_DARK_BLUE;
    color_bajo[2] = GRAPHICS_COLOR_DARK_GREEN;
    color_bajo[3] = GRAPHICS_COLOR_DARK_RED;

    // Juego
    unsigned char secuencia[32]; // array que almacenara las 32 rondas de juego

    unsigned int ronda = 1; // Empezamos en la ronda 1
    unsigned int puntuacion = 0; // La puntuacion inicial es 0

    // Definimos las variables de los tiempos
    unsigned int tiempo_base = 1000; // ms
    unsigned int tiempo = 1000; // ms
    unsigned char modo_rapido = 0;

    unsigned int T = (unsigned int)(tiempo / 25);
    if(T < 2) {
        T = 2;
    }
    unsigned int T4 = (unsigned int)(T / 4);
    if(T4 < 1) {
        T4 = 1;
    }
    unsigned int T2 = (unsigned int)(2 * T);

    // Defino los estados de la FSM
    typedef enum { BIENVENIDA=0, MENSAJE_RONDA, MAQUINA, TURNO_JUGADOR, VICTORIA, VICTORIA_FINAL, FIN } estados_t;
    estados_t estado = BIENVENIDA;

    // Variables auxiliares de la FSM
    unsigned char sub_maquina = 0;
    unsigned int paso_maquina = 0;
    unsigned int paso_jugador = 0;
    unsigned int tms = 0;
    unsigned char estado_joystick = 0;
    unsigned char seleccion = 0;
    unsigned int tflash = 0;

    // Variables victoria
    unsigned int t_vict = 0;
    unsigned int paso_vict = 0;
    unsigned char anim = 0;

    // Variables victoria final
    unsigned int t_victf = 0;
    unsigned int paso_victf = 0;
    unsigned char animf = 0;

    // Melodia victoria final
    #define N_VICTF 18
    static const unsigned int melodia_victf[N_VICTF] = {
        DO,MI,SOL,DO2,RE2,MI2,RE2,DO2,
        0,SOL,LA,SOL,MI,FA,MI,RE,DO,0
    };
    static const unsigned char duracion_victf[N_VICTF] = {
        4,4,4,6,4,4,4,6,
        3,4,4,4,4,4,4,4,8,8
    };

    // Melodia bienvenida
    #define N_BIENV 16
    static const unsigned int melodia_bienv[N_BIENV] = {
        DO,0,MI,0,SOL,0,DO2,0,
        LA,0,SOL,0,FA,0,MI,0
    };
    static const unsigned char duracion_bienv[N_BIENV] = {
        4,2,4,2,4,2,6,3,
        4,2,4,2,4,2,6,6
    };

    unsigned int t_bienv = 0;
    unsigned int paso_bienv = 0;

    // Estrellas victoria final
    #define N_ESTRELLAS 12
    unsigned char star_x[N_ESTRELLAS];
    unsigned char star_y[N_ESTRELLAS];
    unsigned char star_big[N_ESTRELLAS];
    unsigned char star_on[N_ESTRELLAS];

    // Bucle infinito
    while(1){
        LPM0; // Dormimos al micro

        // Entramos cada 25ms
        if(tick){
            tick = 0;
            tms++;

            if(boton1){
                boton1 = 0;
                apaga_sonido();
                estado = VICTORIA_FINAL;
                tms = 0;
            }

            switch(estado){
            // Pantalla de bienvenida
            case BIENVENIDA:
                if(tms == 1){
                    apaga_sonido(); // Buzzer desactivado

                    tiempo = tiempo_base;
                    modo_rapido = 0;

                    Graphics_clearDisplay(&g_sContext);
                    Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_WHITE);
                    Graphics_drawStringCentered(&g_sContext, "SIMON DICE", -1, 64, 50, TRANSPARENT_TEXT); // Dibujamos texto de bienvenida
                    Graphics_drawStringCentered(&g_sContext, "PULSA START", -1, 64, 75, TRANSPARENT_TEXT);

                    t_bienv = 0;
                    paso_bienv = 0;
                }

                t_bienv++;

                if(t_bienv == 1){
                    if(melodia_bienv[paso_bienv] == 0){
                        apaga_sonido();
                    }
                    else{
                        suena_hz(melodia_bienv[paso_bienv]);
                    }
                }

                if(t_bienv >= duracion_bienv[paso_bienv]){
                    t_bienv = 0;
                    paso_bienv++;
                    if(paso_bienv >= N_BIENV){
                        paso_bienv = 0;
                    }
                }

