jaimeevv/simon-says-msp430/Proyecto/main.c
                // Si la flag de start esta a 1, iniciamos el juego
                if(start){
                    start = 0;
                    apaga_sonido();

                    // Si a la vez que pulsamos el boton del joystick lo movemos a la izquierda, entraremos en el modo de simbolos
                    ejex = (unsigned int)lee_ch(0);   // Leemos eje X del joystick
                        if(ejex < 100) {
                            modo_simbolos = 1;            // Joystick a la izquierda símbolos
                        }
                        else {
                            modo_simbolos = 0;            // Centro/derecha colores
                        }

                    // Se decide la semilla aleatoria
                    semilla((uint16_t)(contador_ticks ^ 0xBEEF));
                    for(i=0;i<32;i++){
                        secuencia[i] = aleatorio_1_4();
                    }

                    // Reset del juego
                    ronda = 1;
                    puntuacion = 0;
                    paso_maquina = 0;
                    paso_jugador = 0;
                    sub_maquina = 0;

                    // Duracion de la secuencia de la maquina
                    T = (unsigned int)(tiempo / 25);
                    if(T < 2) {
                      T = 2;
                    }

                    // Tiempo entre pasos de la secuencia
                    T4 = (unsigned int)(T / 4);
                    if(T4 < 1) {
                        T4 = 1;
                    }

                    // Duracion de la secuencia del jugador
                    T2 = (unsigned int)(2 * T); //

                    estado = MENSAJE_RONDA; // Saltamos al estado de mostrar el mensaje de la ronda
                    tms = 0;
                }
                break;

            // Estado de mensaje entre ronda y ronda
            case MENSAJE_RONDA:
                if(tms == 1){
                    char cad[20];
                    apaga_sonido(); // Buzzer desactivado

                    // Dibujamos el texto de por que ronda vamos
                    Graphics_clearDisplay(&g_sContext);
                    sprintf(cad, "RONDA %d", ronda);
                    Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_WHITE);
                    Graphics_drawStringCentered(&g_sContext, (int8_t*)cad, -1, 64, 55, TRANSPARENT_TEXT);
                    Graphics_drawStringCentered(&g_sContext, "MIRA...", -1, 64, 80, TRANSPARENT_TEXT);

                    paso_maquina = 0;
                    sub_maquina = 0;
                }

                // Tiempo de espera la pantalla de ronda
                if(tms >= (800/25)){
                    Graphics_clearDisplay(&g_sContext); // Limpiamos la pantalla

                    // Dibujamos el marco
                    Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_WHITE);
                    Graphics_drawRectangle(&g_sContext, &marco);

                    // Dibujamos la barra de progreso de la ronda
                    Graphics_drawRectangle(&g_sContext, &barra);
                    Graphics_drawRectangle(&g_sContext, &caja_pct);
                    Graphics_drawString(&g_sContext, "%", -1, 122, 7, TRANSPARENT_TEXT);

                    // Dibujamos los 4 rectangulos de color o simbolos
                    for(i=0;i<4;i++){
                        // Si no estamos en el modo de simbolos, dibujamos los rectangulos de color
                        if(!modo_simbolos){
                            Graphics_setForegroundColor(&g_sContext, color_bajo[i]);
                            Graphics_fillRectangle(&g_sContext, &boton[i]);
                        }
                        // Si estamos en el modo de simbolos, dibujamos los simbolos
                        else{
                            Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_BLACK);
                            Graphics_fillRectangle(&g_sContext, &boton[i]);
                            Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_WHITE);
                            Graphics_drawStringCentered(&g_sContext,(int8_t*)simbolos[i],-1,(boton[i].xMin + boton[i].xMax)/2,(boton[i].yMin + boton[i].yMax)/2,TRANSPARENT_TEXT);
                        }
                    }

                    estado = MAQUINA; // Saltamos al estado en el que se reproduce la secuencia que se debe memorizar
                    tms = 0;
                }
                break;

            case MAQUINA:
                // Si ya se han mostrado todos los pasos de esa ronda, pasamos al turno del jugador
                if(paso_maquina >= ronda){
                    apaga_sonido(); // Buzzer desactivado

                    // Dibujamos los 4 rectangulos de color o simbolos
                    for(i=0;i<4;i++){
                        // Si no estamos en el modo de simbolos, dibujamos los rectangulos de color
                        if(!modo_simbolos){
                            Graphics_setForegroundColor(&g_sContext, color_bajo[i]);
                            Graphics_fillRectangle(&g_sContext, &boton[i]);
                        }
                        // Si estamos en el modo de simbolos, dibujamos los simbolos
                        else{
                            Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_BLACK);
                            Graphics_fillRectangle(&g_sContext, &boton[i]);
                            Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_WHITE);
                            Graphics_drawStringCentered(&g_sContext,(int8_t*)simbolos[i],-1,(boton[i].xMin + boton[i].xMax)/2,(boton[i].yMin + boton[i].yMax)/2,TRANSPARENT_TEXT);
                        }
                    }

                    paso_jugador = 0;
                    estado_joystick = 0;
                    estado = TURNO_JUGADOR; //  Saltamos al estado en el que el jugador debe reproducir la secuencia
                    tms = 0;
                    break;
                }

                // Subestado para iluminar color
                if(sub_maquina == 0){
                    if(tms == 1){

