jaimeevv/simon-says-msp430/Proyecto/main.c
                        unsigned char color = secuencia[paso_maquina]; // Asignamos el color por el que va la secuencia
                        unsigned char color_aux = color - 1; // Array de 0 a 3

                        // Si no estamos en el modo de simbolos, iluminamos el color correspondiente
                        if(!modo_simbolos){
                            Graphics_setForegroundColor(&g_sContext, color_alto[color_aux]);
                            Graphics_fillRectangle(&g_sContext, &boton[color_aux]);
                        }
                        // Si estamos en el modo de simbolos, iluminamos el simbolo correspondiente
                        else{
                            Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_WHITE);
                            Graphics_fillRectangle(&g_sContext, &boton[color_aux]);
                            Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_BLACK);
                            Graphics_drawStringCentered(&g_sContext,(int8_t*)simbolos[color_aux],-1,(boton[color_aux].xMin + boton[color_aux].xMax)/2,(boton[color_aux].yMin + boton[color_aux].yMax)/2,TRANSPARENT_TEXT);
                        }

                        sonido_color(color); // Suena el sonido correspondiente del color seleccionado

                        // Barra progreso maquina (relleno rojo)
                        Graphics_Rectangle interior = barra;
                        interior.xMin += 1;
                        interior.yMin += 1;
                        interior.xMax -= 1;
                        interior.yMax -= 1;

                        Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_BLACK);
                        Graphics_fillRectangle(&g_sContext, &interior);

                        unsigned int W = interior.xMax - interior.xMin; // Tamaño de la barra de progreso
                        unsigned int relleno = (unsigned int)((unsigned long)W * (paso_maquina+1) / ronda); // Tamaño del relleno actual
                        // Dibujamos el relleno
                        if(relleno > 0){
                            Graphics_Rectangle f = interior;
                            f.xMax = f.xMin + relleno;
                            Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_RED);
                            Graphics_fillRectangle(&g_sContext, &f);
                        }
                    }

                    // Tras T segundos
                    if(tms >= T){
                        unsigned char color = secuencia[paso_maquina];
                        unsigned char color_aux = color - 1;
                        // Si no estamos en el modo de simbolos, apagamos el color iluminado
                        if(!modo_simbolos){
                            Graphics_setForegroundColor(&g_sContext, color_bajo[color_aux]);
                            Graphics_fillRectangle(&g_sContext, &boton[color_aux]);
                        }
                        // Si estamos en el modo de simbolos, apagamos el simbolo iluminado
                        else {
                            Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_BLACK);
                            Graphics_fillRectangle(&g_sContext, &boton[color_aux]);
                            Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_WHITE);
                            Graphics_drawStringCentered(&g_sContext,(int8_t*)simbolos[color_aux],-1,(boton[color_aux].xMin + boton[color_aux].xMax)/2,(boton[color_aux].yMin + boton[color_aux].yMax)/2,TRANSPARENT_TEXT);
                        }

                        apaga_sonido(); // Buzzer desactivado
                        sub_maquina = 1; // Pasamos al subestado de pausa entre colores
                        tms = 0;
                    }
                }

                else {
                    if(tms >= T4){
                        paso_maquina++; // Si pasa el tiempo de pausa, pasamos al siguiente paso de la secuencia
                        sub_maquina = 0; // Volvemos al subestado de iluminar el color
                        tms = 0;
                    }
                }
                break;

            case TURNO_JUGADOR: {
                // Si se acaba el tiempo para seleccionar el color, saltamos al estado de game over
                if(tms >= T2){
                    estado = FIN;
                    tms = 0;
                    apaga_sonido();
                    break;
                }

                if(tms == 1){
                    // Inicializamos los botones según el modo
                    for(i=0; i<4; i++){
                        // Si estamos en el modo de simbolos, inicializamos los simbolos apagados
                        if(modo_simbolos){
                            Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_BLACK); // fondo negro
                            Graphics_fillRectangle(&g_sContext, &boton[i]);
                            Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_WHITE); // letra blanca
                            Graphics_drawStringCentered(&g_sContext,(int8_t*)simbolos[i],-1,(boton[i].xMin + boton[i].xMax)/2,(boton[i].yMin + boton[i].yMax)/2,TRANSPARENT_TEXT);
                        }
                        // Si no estamos en el modo de simbolos, inicializamos los rectangulos de color apagado
                        else{
                            Graphics_setForegroundColor(&g_sContext, color_bajo[i]);
                            Graphics_fillRectangle(&g_sContext, &boton[i]);
                        }
                    }
                }

                // Variables para leer la posicion del joystick
                ejex = (unsigned int)lee_ch(0);
                ejey = (unsigned int)lee_ch(3);

                //Desplazamiento respecto al centro del joystick
                int dx = (int)ejex - 512;
                int dy = (int)ejey - 512;

                // Dejamos una zona muerta en el medio para que no se elija un color por error
                if(dx < 100 && dx > -100 && dy < 100 && dy > -100){
                    estado_joystick = 0;
                }

