jaimeevv/simon-says-msp430/Proyecto/main.c
                unsigned char elegido = 0;

                if(estado_joystick == 0){
                    // Si salimos de la zona muerta, registramos el color
                    if(!(dx < 100 && dx > -100 && dy < 100 && dy > -100)) {
                        estado_joystick = 1;

                        // Comparamos si el joystick se esta moviendo mas en el eje x o en el eje y
                        int adx = (dx<0)?-dx:dx;
                        int ady = (dy<0)?-dy:dy;

                        // Si el joystick se mueve en el eje x
                        if(adx > ady) {
                            if(dx > 0) {
                                elegido = 2;  // Derecha
                            }
                            else {
                                elegido = 4;  // Izquierda
                            }
                        }

                        // Si el joystick se mueve en el eje y
                        else {
                            if(dy > 0) {
                                elegido = 1;  // Arriba
                            }
                            else {
                                elegido = 3;  // Abajo
                            }
                        }
                    }
                }

                // Si se ha elegido algun color
                if(elegido != 0) {
                    unsigned char esperado = secuencia[paso_jugador];

                    {
                        unsigned char color_aux = elegido - 1;
                        // Si no estamos en el modo de simbolos, se ilumina automaticamente el color seleccionado
                        if(!modo_simbolos) {
                            Graphics_setForegroundColor(&g_sContext, color_alto[color_aux]);
                            Graphics_fillRectangle(&g_sContext, &boton[color_aux]);
                        }
                        // Si estamos en el modo de simbolos, se ilumina automaticamente el simbolo seleccionado
                        else {
                            Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_WHITE);
                            Graphics_fillRectangle(&g_sContext, &boton[color_aux]);
                            Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_BLACK);
                            Graphics_drawStringCentered(&g_sContext,(int8_t*)simbolos[color_aux],-1,(boton[color_aux].xMin + boton[color_aux].xMax)/2,(boton[color_aux].yMin + boton[color_aux].yMax)/2,TRANSPARENT_TEXT);
                        }

                        sonido_color(elegido); // Suena la nota musical correspondiente al color o simbolo elegido
                        seleccion = elegido;
                        tflash = 0;
                    }

                    // Si el color elegido es el correcto
                    if(elegido == esperado){
                        puntuacion++; // Aumentamos en 1 la puntuacion
                        paso_jugador++; // Pasamos al siguiente paso de la ronda

                        // Barra progreso jugador (relleno blanco)
                        Graphics_Rectangle interior = barra;
                        interior.xMin += 1;
                        interior.yMin += 1;
                        interior.xMax -= 1;
                        interior.yMax -= 1;

                        Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_BLACK);
                        Graphics_fillRectangle(&g_sContext, &interior);

                        unsigned int W = interior.xMax - interior.xMin; // Tamaño de la barra de progreso
                        unsigned int relleno = (unsigned int)((unsigned long)W * (paso_jugador) / ronda); // Tamaño del relleno
                        // Dibujamos el relleno
                        if(relleno > 0){
                            Graphics_Rectangle f = interior;
                            f.xMax = f.xMin + relleno;
                            Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_WHITE);
                            Graphics_fillRectangle(&g_sContext, &f);
                        }

                        // Si el jugador completa todos los pasos correctamente, se pasa al estado de ronda completada
                        if(paso_jugador >= ronda){
                            estado = VICTORIA;
                            tms = 0;
                            t_vict = 0;
                            paso_vict = 0;
                            anim = 0;
                            apaga_sonido();
                        }
                        else{
                            tms = 0;
                        }
                    }
                    // Si el color elegido es incorrecto, saltamos al estado de game over
                    else {
                        estado = FIN;
                        tms = 0;
                    }
                }
                // Si se ha seleccionado un color o simbolo
                if(seleccion != 0){
                    tflash++; // Aumentamos el tiempo auxiliar de la iluminacion
                    if(tflash >= (T/2)) {
                        unsigned char color_aux = seleccion - 1;
                        // Tras seleccionar un color, este se apaga tras T/2
                        if(!modo_simbolos) {
                            Graphics_setForegroundColor(&g_sContext, color_bajo[color_aux]);
                            Graphics_fillRectangle(&g_sContext, &boton[color_aux]);
                        }
                        // Tras seleccionar un simbolo, este se apaga tras T/2
                        else {
                            Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_BLACK); // fondo negro
                            Graphics_fillRectangle(&g_sContext, &boton[color_aux]);
                            Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_WHITE); // letra blanca
                            Graphics_drawStringCentered(&g_sContext,(int8_t*)simbolos[color_aux],-1,(boton[color_aux].xMin + boton[color_aux].xMax)/2,(boton[color_aux].yMin + boton[color_aux].yMax)/2,TRANSPARENT_TEXT);
                        }

                        apaga_sonido(); // Buzzer desactivado
                        seleccion = 0;
                    }
                }

                break;
            }

