jaimeevv/simon-says-msp430/Proyecto/main.c
            // Estado de ronda completada
            case VICTORIA:
                if(tms == 1) {
                    Graphics_clearDisplay(&g_sContext);
                    // Pintamos el mensaje de ronda superada
                    Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_WHITE);
                    Graphics_drawStringCentered(&g_sContext, "RONDA", -1, 64, 45, TRANSPARENT_TEXT);
                    Graphics_drawStringCentered(&g_sContext, "SUPERADA", -1, 64, 65, TRANSPARENT_TEXT);

                    // Inicializamos el marco y el dibujo de la animacion
                    Graphics_drawRectangle(&g_sContext, &marco_eq);
                    Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_BLACK);
                    Graphics_fillRectangle(&g_sContext, &barra1);
                    Graphics_fillRectangle(&g_sContext, &barra2);
                    Graphics_fillRectangle(&g_sContext, &barra3);

                    paso_vict = 0;
                    t_vict = 0;
                    anim = 0;
                }

                t_vict++; // Aumentamos el tiempo auxiliar de victoria para temporizar las notas de la musica de ronda superada

                // Secuencia de notas de la musica de victoria (pares sonido, impares silencio)
                if(paso_vict == 0) {
                    suena_hz(DO);
                }
                if(paso_vict == 1) {
                    apaga_sonido();
                }
                if(paso_vict == 2) {
                    suena_hz(MI);
                }
                if(paso_vict == 3) {
                    apaga_sonido();
                }
                if(paso_vict == 4) {
                    suena_hz(SOL);
                }
                if(paso_vict == 5) {
                    apaga_sonido();
                }
                if(paso_vict == 6) {
                    suena_hz(DO2);
                }
                if(paso_vict == 7) {
                    apaga_sonido();
                }
                if(paso_vict == 8) {
                    suena_hz(SOL);
                }
                if(paso_vict == 9) {
                    apaga_sonido();
                }
                if(paso_vict == 10) {
                    suena_hz(DO2);
                }
                if(paso_vict == 11) {
                    apaga_sonido();
                }

                // Si el paso es par (sonido), dura 150 ms
                if((paso_vict % 2) == 0){
                    if(t_vict >= 6) {
                        t_vict = 0;
                        paso_vict++;
                    }
                }
                // Si el paso es impar (silencio), dura 50 ms
                else {
                    if(t_vict >= 2) {
                        t_vict = 0;
                        paso_vict++;
                    }
                }
                // Animacion cada 50 ms
                if((tms % 2) == 0){
                    // Borramos las barras anteriores del ecualizador para poder dibujar unas nuevas
                    Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_BLACK);
                    Graphics_fillRectangle(&g_sContext, &barra1);
                    Graphics_fillRectangle(&g_sContext, &barra2);
                    Graphics_fillRectangle(&g_sContext, &barra3);

                    unsigned char h1=8, h2=18, h3=12; // Alturas iniciales de las barras del ecualizador
                    // 4 patrones de alturas segun el instante de la animacion
                    if(anim==0) {
                        h1=8;  h2=18; h3=12;
                    }
                    if(anim==1) {
                        h1=18; h2=10; h3=16;
                    }
                    if(anim==2) {
                        h1=12; h2=16; h3=8;
                    }
                    if(anim==3) {
                        h1=16; h2=8;  h3=18;
                    }

                    // Si es un paso impar (silencio), barras del ecualizador pequeñas
                    if((paso_vict % 2) == 1){
                        h1 = 6; h2 = 6; h3 = 6;
                    }

                    Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_WHITE);

                    // Calculamos las coordenadas de las barras variables segun h1, h2 y h3
                    Graphics_Rectangle b1 = barra1;
                    b1.yMin = (unsigned int)(barra1.yMax - h1);
                    Graphics_Rectangle b2 = barra2;
                    b2.yMin = (unsigned int)(barra2.yMax - h2);
                    Graphics_Rectangle b3 = barra3;
                    b3.yMin = (unsigned int)(barra3.yMax - h3);

                    // Dibujamos las barras del ecualizador
                    Graphics_fillRectangle(&g_sContext, &b1);
                    Graphics_fillRectangle(&g_sContext, &b2);
                    Graphics_fillRectangle(&g_sContext, &b3);

                    anim++; // Sumamos 1 a la variable que segun su valor va cambiando la animacion

                    if(anim >= 4) {
                        anim = 0; // Como tenemos 4 estados posibles de la animacion, cuando llegamos a 5, reseteamos la animacion
                    }
                }

                // Una vez acabe la melodia
                if(paso_vict >= 12){
                    apaga_sonido(); // Buzzer desactivado
                    ronda++; // Pasamos a la siguiente ronda

                    if(ronda > 32){
                        estado = VICTORIA_FINAL;
                        tms = 0;
                        break;
                    }

                    paso_maquina = 0;
                    sub_maquina = 0;
                    paso_jugador = 0;
                    seleccion = 0;

                    estado = MENSAJE_RONDA;
                    tms = 0;
                }
                break;

            // Estado de victoria final
            case VICTORIA_FINAL:
                if(tms == 1){
                    apaga_sonido(); // Buzzer desactivado
                    Graphics_clearDisplay(&g_sContext);

