jaimeevv/simon-says-msp430/Proyecto/main.c
                    Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_WHITE);
                    Graphics_drawStringCentered(&g_sContext, "VICTORIA!", -1, 64, 45, TRANSPARENT_TEXT);
                    Graphics_drawStringCentered(&g_sContext, "PULSA START", -1, 64, 95, TRANSPARENT_TEXT);

                    t_victf = 0;
                    paso_victf = 0;
                    animf = 0;

                    for(i=0;i<N_ESTRELLAS;i++){
                        star_x[i] = (unsigned char)(4 + (lfsr_siguiente() % 120));
                        if((lfsr_siguiente() & 1) == 0){
                            star_y[i] = (unsigned char)(8 + (lfsr_siguiente() % 22));
                        }else{
                            star_y[i] = (unsigned char)(85 + (lfsr_siguiente() % 35));
                        }
                        star_big[i] = (unsigned char)(lfsr_siguiente() & 1);
                        star_on[i] = 0;
                    }
                }

                t_victf++;

                if(t_victf == 1){
                    if(melodia_victf[paso_victf] == 0){
                        apaga_sonido();
                    }
                    else{
                        suena_hz(melodia_victf[paso_victf]);
                    }
                }

                if(t_victf >= duracion_victf[paso_victf]){
                    t_victf = 0;
                    paso_victf++;
                    if(paso_victf >= N_VICTF){
                        paso_victf = 0;
                    }
                }

                if((tms % 2) == 0){
                    unsigned char k = (unsigned char)(lfsr_siguiente() % N_ESTRELLAS);

                    if(star_on[k]){
                        dibuja_estrella(star_x[k], star_y[k], star_big[k], GRAPHICS_COLOR_BLACK);
                        star_on[k] = 0;
                    }else{
                        star_big[k] = (unsigned char)(star_big[k] ^ 1);
                        dibuja_estrella(star_x[k], star_y[k], star_big[k], GRAPHICS_COLOR_YELLOW);
                        star_on[k] = 1;
                    }

                    animf++;
                    if(animf >= 4) animf = 0;
                }

                if(start){
                    start = 0;

                    modo_rapido = 1;
                    tiempo = (unsigned int)(tiempo_base/2);

                    T = (unsigned int)(tiempo / 25);
                    if(T < 2) T = 2;
                    T4 = (unsigned int)(T / 4);
                    if(T4 < 1) T4 = 1;
                    T2 = (unsigned int)(2 * T);

                    // Se decide la semilla aleatoria
                    semilla((uint16_t)(contador_ticks ^ 0xBEEF));
                    for(i=0;i<32;i++){
                        secuencia[i] = aleatorio_1_4();
                    }

                    // Reset del juego
                    ronda = 1;
                    puntuacion = 0;
                    paso_maquina = 0;
                    paso_jugador = 0;
                    sub_maquina = 0;
                    seleccion = 0;

                    estado = MENSAJE_RONDA;
                    tms = 0;
                    apaga_sonido();
                }

                break;

            // Estado de game over
            case FIN:
                if(tms == 1) {
                    char cad[24];
                    apaga_sonido(); // Buzzer desactivado

                    if(modo_rapido){
                        modo_rapido = 0;
                        tiempo = tiempo_base;

                        T = (unsigned int)(tiempo / 25);
                        if(T < 2) T = 2;
                        T4 = (unsigned int)(T / 4);
                        if(T4 < 1) T4 = 1;
                        T2 = (unsigned int)(2 * T);
                    }

                    Graphics_clearDisplay(&g_sContext);
                    // Pintamos mensaje de game over
                    Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_WHITE);
                    Graphics_drawStringCentered(&g_sContext, "GAME OVER", -1, 64, 45, TRANSPARENT_TEXT);
                    // Pintamos los puntos conseguidos
                    sprintf(cad, "PUNTOS: %d", puntuacion);
                    Graphics_drawStringCentered(&g_sContext, (int8_t*)cad, -1, 64, 70, TRANSPARENT_TEXT);
                    // Pintamos el mensaje de pulsar start para comenzar otra partida
                    Graphics_drawStringCentered(&g_sContext, "PULSA START", -1, 64, 95, TRANSPARENT_TEXT);

                    suena_hz(150); // Suena el sonido de game over
                }
                // Tras un tiempo, apagamos el sonido de derrota
                if(tms >= (600/25)) {
                    apaga_sonido();
                }
                // Si pulsamos start, volvemos a la pantalla de bienvenida
                if(start) {
                    start = 0;
                    estado = BIENVENIDA;
                    tms = 0;
                }
                break;
            }
        }
    }
}
